filename = ['qibao', 'shanghaiiapm', 'wujiaochang', 'nanjingeast', 'pudong', 'globalharbor','hongkongplaza', 'kunming', 
'sanlitun', 'chinacentralmall', 'chaoyangjoycity', 'wangfujing', 'xidanjoycity', 'mixcchengdu', 'taikoolichengdu', 'tianjinjoycity','riverside66tianjin',
'mixctianjin', 'parc66jinan', 'mixcqingdao', 'parccentral','zhujiangnewtown', 'holidayplazashenzhen', 'mixcnanning', 'nanjingist', 'nanjingjinmaoplace', 
'wondercity', 'center66wuxi', 'suzhou', 'mixczhengzhou', 'tianyisquare', 'mixchangzhou', 'westlake', 'xiamenlifestylecenter', 'tahoeplaza', 
'olympia66dalian', 'parkland', 'zhongjiejoycity', 'mixcshenyang', 'jiefangbei', 'mixcchongqing', 'paradisewalkchongqing']
storename = ['七宝', '上海环贸 iapm', '五角场', '南京东路', '浦东', '环球港', '香港广场', '昆明', 
'三里屯', '华贸购物中心', '朝阳大悦城', '王府井', '西单大悦城', '成都万象城', '成都太古里', '天津大悦城', '天津恒隆广场', 
'天津万象城', '济南恒隆广场', '青岛万象城', '天环广场', '珠江新城', '深圳益田假日广场', '南宁万象城', '南京艾尚天地', '南京金茂汇', 
'虹悦城', '无锡恒隆广场', '苏州', '郑州万象城', '天一广场', '杭州万象城', '西湖', '厦门新城市广场', '泰禾广场', 
'大连恒隆广场', '百年城', '中街大悦城', '沈阳万象城', '解放碑', '重庆万象城', '重庆北城天街',
'ifc mall', 'Festival Walk', 'Canton Road', 'New Town Plaza', 'apm Hong Kong', 'Causeway Bay',
'澳門銀河', '金沙廣場', '信義 A13', '台北 101']
storeID = [705, 401, 581, 359, 389, 683, 390, 670,
320, 479, 645, 448, 388, 502, 580, 637, 579,
638, 648, 557, 577, 639, 484, 571, 493, 703,
643, 574, 688, 572, 531, 532, 471, 644, 646,
609, 478, 534, 576, 480, 573, 476,
428, 485, 499, 610, 673, 409,
672, 697, 694, 713]
stateCHN = ["新加坡", "土耳其", "阿联酋", "英国", "德国", "台湾", "美国", 
"墨西哥", "瑞士", "比利时", "荷兰", "泰国", "西班牙", "香港", "瑞典", "中国", 
"法国", "澳大利亚", "意大利", "澳门", "巴西", "日本", "韩国", "加拿大", "奥地利"]
stateCode = ["SG", "TR", "AE", "UK", "DE", "TW", "US", 
"MX", "CH", "BE", "NL", "TH", "ES", "HK", "SE", "CN", 
"FR", "AU", "IT", "MO", "BR", "JP", "KR", "CA", "AT"]
stateEmoji = ["🇸🇬", "🇹🇷", "🇦🇪", "🇬🇧", "🇩🇪", "🇹🇼", "🇺🇸", 
"🇲🇽","🇨🇭", "🇧🇪", "🇳🇱", "🇹🇭", "🇪🇸", "🇭🇰", "🇸🇪", "🇨🇳", 
"🇫🇷", "🇦🇺", "🇮🇹", "🇦🇹", "🇲🇴", "🇧🇷", "🇯🇵", "🇰🇷", "🇨🇦", "🇦🇹"]
specialistCode = [8238, 8164, 8225, 8145, 8043, 8311, 8158, 
8297, 8017, 8251, 8119, 8346, 8056, 8082, 8132, 8030, 8069,
7991, 8095, 8282, 8176, 8107, 8326, 8004, 8333]